while True:
    M = int (input ("Введіть кількість кілометрів за перший день: "))
    K = int (input ("Введіть на скільки кілометрів збільшилась норма пробігу: "))
    n = 100
    for E in range (n):
        kmnum = M+E*K
        print (str(kmnum) + 'км ' + '— ' + str(E+1) + ' день')
        if kmnum >= 50:
            C = "Ви досягли позначку у 50км!"
            print (C)
            counter = E+1
            break
    if M < 50:
        print ('Пробігши ' + str(M) + 'км у перший день і збільшуючи норму пробігу кожен день на ' + str(K) + 
        'км, ви зможете досягти позначку в 50км за ' + str(counter) + ' днів')
    else:
        print ('Доволі непогано, ви вже в перший день подолали межу в 50км, пробігши ' + str(M) + ' кілометрів! Є чим пишатися. Так тримати, вперед до нових рекордів!')